podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/AIPS0_MK82F25615.svd.xml
            <register>
               <name>PACRL</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x5C</addressOffset>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP2</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP2</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP2</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PACRM</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x60</addressOffset>
               <resetValue>0x4404444</resetValue>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP2</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP2</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP2</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PACRN</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP2</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP2</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP2</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PACRO</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x68</addressOffset>
               <resetValue>0x444000</resetValue>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP2</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP2</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP2</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
